# Author: SJasonP <SJasonP@iCloud.com>
# Repo: https://github.com/SJasonP/CollegeStudy

"""
创建一个名为cities的字典，将三个城市名用作键。
对于每个城市，都创建一个字典，并在其中包含该城市所属的省份、著名经典、经典小吃等内容。
将每个城市的字典省份、著名景点、经典小吃等键。将每座城市的名字及相关信息都打印出来
"""

cities = {
    "成都": {
        "省份": "四川",
        "景点": "都江堰",
        "美食": "火锅"
    },
    "西安": {
        "省份": "陕西",
        "景点": "秦始皇兵马俑",
        "美食": "羊肉泡馍"
    },
    "杭州": {
        "省份": "浙江",
        "景点": "西湖",
        "美食": "东坡肉"
    }
}

for c in cities:
    d = cities[c]
    print(c, "属于", d["省份"], "，著名的景点有", d["景点"], "典型美食是", d["美食"])